"Common.Cancel" = "Prekliči";

"Common.OK" = "V redu";

"Common.Info" = "Informacije";

"Common.Warning" = "Opozorilo";

"Common.Error" = "Napaka";

"Common.Yes" = "Da";

"Common.No" = "Ne";

"Common.Settings" = "Nastavitve";

"Common.Logout" = "Odjava";

/* MARK: - Endpoint */
"Endpoint.Training" = "https://ubilabstest.sapsailing.com";

/* MARK: - RegattaCheckInController */
"RegattaCheckInController.WelcomeAlert.Title" = "Pozdravljeni, %@";

"RegattaCheckInController.WelcomeAlert.Message" = "Vpisujete se kot %@";

"RegattaCheckInController.WelcomeAlert.CancelAction.Title" = "To nisem jaz!";

/* MARK: - GPSFixController */
"GPSFixController.Mode" = "Način";

"GPSFixController.Mode.Error" = "Napaka API";

"GPSFixController.Mode.BatterySaving" = "Varčevanje z baterijo";

"GPSFixController.Mode.None" = "-";

"GPSFixController.Mode.Online" = "Dosegljiv";

"GPSFixController.Mode.Offline" = "Nedosegljiv";

/* MARK: - LocationManager */
"LocationManager.LocationServicesDeniedError" = "GPS je izklopljen za to aplikacijo, za spremljanje pa so potrebni položaji GPS. Ali želite vklopiti GPS v nastavitvah lokacije?";

"LocationManager.LocationServicesDisabledError" = "GPS je izklopljen, za spremljanje pa so potrebni položaji GPS. Ali želite vklopiti GPS v nastavitvah lokacije?";

"LocationManager.Status" = "Status";

"LocationManager.Status.Tracking" = "Sledenje";

"LocationManager.Status.NotTracking" = "Ni signala GPS!";

/* MARK: - CheckInDataCollectorError */
"CheckInDataCollectorError.CheckInDataIsIncomplete" = "ID tekmovalca ali oznake ni najden v QR-kodi.";

/* MARK: - CheckInRequestManagerError */
"CheckInRequestManagerError.CommunicationFailed" = "Na strežniku ni bilo mogoče dokončati postopka. Poskusite znova.";

"CheckInRequestManagerError.GetBoatFailed" = "Jadrnice ni bilo mogoče priklicati.";

"CheckInRequestManagerError.GetCompetitorFailed" = "Tekmovalca ni bilo mogoče priklicati.";

"CheckInRequestManagerError.GetEventFailed" = "Dogodka ni bilo mogoče priklicati.";

"CheckInRequestManagerError.GetLeaderboardFailed" = "Lestvice vodilnih ni bilo mogoče priklicati.";

"CheckInRequestManagerError.GetMarkFailed" = "Oznake ni bilo mogoče priklicati.";

"CheckInRequestManagerError.GetTeamFailed" = "Ekipe ni bilo mogoče priklicati.";

"CheckInRequestManagerError.PostCheckInFailed" = "Prijava ni uspela.";

"CheckInRequestManagerError.PostCheckOutFailed" = "Odjava ni uspela.";

"CheckInRequestManagerError.PostGPSFixFailed" = "Položajev GPS ni bilo mogoče poslati.";

"CheckInRequestManagerError.PostTeamImageFailed" = "Slike ekipe ni bilo mogoče prenesti v strežnik.";

"CheckInRequestManagerError.TeamImageURLIsInvalid" = "URL slike ekipe ni veljaven.";

/* MARK: - StartView */
"StartView.RegattaButton.Title" = "Regate";

"StartView.TrainingButton.Title" = "Posamezni trening";

/* MARK: - AboutView */
"AboutView.Title" = "O aplikaciji";

"AboutView.PartnershipTextView.Text" = "Aplikacija SAP Sail InSight podpira sledenje jadrnic v živo z uporabo tehnologije mobilnih telefonov. Tako lahko prijatelji in oboževalci na aktualnih lestvicah vodilnih in 2D-prikazu spremljajo tekmovanje na lokaciji ali na spletu. Tovrstno sledenje jadralcev omogoča vnovično predvajanje tekmovanja in s tem možnost za pregled nastopa in izboljšanje strategije. Vse to najdete na: https://www.sapsailing.com\n\nDružba SAP podpira Združenje jadralcev ZDA (US Sailing) z uvajanjem številnih novih tehnoloških rešitev, zagotavljanjem analitike, ki pomaga ekipam in jadralcem izboljšati nastope, in nudenjem aplikacij za učinkovitejše jadranje.\n\nZdruženje US Sailing je kot nacionalni upravni organ za jadranje odgovorno za vodenje, integriteto in rast športa. Njegova pristojnost vključuje programe za usposabljanje in izobraževanje inštruktorjev ter regatnih funkcionarjev, ob tem pa tudi upravljanje in nadzor tekmovalnega jadranja po vsej državi.";

"AboutView.TermsButton.Title" = "Licenčni pogoji";

"AboutView.VersionTitleLabel.Text" = "Različica";

/* MARK: - CourseView */
"CourseView.TitleLabel.Text" = "Kurz preko dna";

/* MARK: - RegattaCheckInListView */
"RegattaCheckInListView.Title" = "Regate";

"RegattaCheckInListView.HeaderTitleLabel.Text" = "Vaše regate:";

"RegattaCheckInListView.FooterTextView.Text" = "Več informacij najdete na\nhttps://sapsailing.com";

"RegattaCheckInListView.InfoCodeLabel.Text" = "QR-kodo lahko najdete na potrditvi udeležbe.";

"RegattaCheckInListView.TermsAlert.Title" = "Licenčni pogoji";

"RegattaCheckInListView.TermsAlert.Message" = "S prenosom aplikacije potrjujete, da sprejemate pogoje licenčne pogodbe za končne uporabnike. Preberite te licenčne pogoje tukaj.";

"RegattaCheckInListView.TermsAlert.ShowTermsAction.Title" = "Licenčni pogoji";

"RegattaCheckInListView.TermsAlert.AcceptTermsAction.Title" = "Potrdi";

"RegattaCheckInListView.NoCameraAlert.Message" = "Naprava nima kamere.";

"RegattaCheckInListView.NoCodeAlert.Title" = "Ali nimate QR-kode?";

"RegattaCheckInListView.NoCodeAlert.Message" = "Če niste prejeli QR-kode, se obrnite na organizatorja tekmovanja.";

/* MARK: - TrainingCheckInListView */
"TrainingCheckInListView.Title" = "Treningi";

"TrainingCheckInListView.HeaderTitleLabel.Text" = "Vaši treningi:";

"TrainingCheckInListView.FooterTextView.Text" = "Če želite upravljati seje treningov, ustvarite vsaj en trening, tako da uporabite gumb za plus.";

/* MARK: - TrainingView */
"TrainingView.LeaderboardButton.Title" = "Analiza";

"TrainingView.OptionSheet.CheckOutAction.Title" = "Odstrani trening";

"TrainingView.FinishButton.Title" = "Končaj";

"TrainingView.ReactivateAlert.Title" = "Znova aktiviraj trening";

"TrainingView.ReactivateAlert.Message" = "Ta seja treninga je končana. Ali res želite nadaljevati in znova aktivirati to sejo?";

"TrainingView.ReactivatedAlert.Title" = "Seja treninga je zdaj aktivna.";

"TrainingView.FinishAlert.Title" = "Končaj trening";

"TrainingView.FinishAlert.Message" = "Ali res želite končati to sejo treninga?";

"TrainingView.FinishedAlert.Title" = "Seja treninga je bila uspešno končana.";

"TrainingView.CheckOutAlert.Message" = "Ali RES želite odstraniti to sejo treninga iz svoje naprave?";

/* MARK: - CreateTrainingView */
"CreateTrainingView.Title" = "Ustvari trening";

"CreateTrainingView.BoatClassNameLabel.Text" = "Kategorija jadrnice";

"CreateTrainingView.CreateTrainingButton.Title" = "Ustvari trening";

/* MARK: - LeaderboardView */
"LeaderboardView.Title" = "Lestvica vodilnih";

/* MARK: - LicenseView */
"LicenseView.Title" = "Podatki o licenci";

/* MARK: - RegattaView */
"RegattaView.CountdownDaysTitleLabel.Text" = "Dnevi";

"RegattaView.CountdownHoursTitleLabel.Text" = "Ure";

"RegattaView.CountdownMinutesTitleLabel.Text" = "Minute";

"RegattaView.StartLabel.Text.BeforeRegattaDidStart" = "Regata se začne čez:";

"RegattaView.StartLabel.Text.AfterRegattaDidStart" = "Regata poteka.";

"RegattaView.AnnouncementLabel.Text" = "Poslušajte obvestila.";

"RegattaView.EventButton.Title" = "Dogodek";

"RegattaView.StartTrackingButton.Title" = "Začni sledenje";

"RegattaView.OptionSheet.CheckOutAction.Title" = "Odjava";

"RegattaView.CheckOutAlert.Message" = "Ali se RES želite odjaviti? Za dostop do regate se boste morali znova prijaviti s prejeto QR-kodo.";

/* MARK: - CompetitorView */
"CompetitorView.SelectImageAlert.Title" = "Fotografija";

"CompetitorView.SelectImageAlert.Message" = "Želite uporabiti obstoječo sliko ali posneti novo?";

"CompetitorView.SelectImageAlert.CameraAction.Title" = "Posnemi fotografijo";

"CompetitorView.SelectImageAlert.PhotoLibraryAction.Title" = "Obstoječa";

"CompetitorView.TeamImageUploadRetryButton.Title" = "Napaka pri prenosu v strežnik.\nTapnite, da poskusite znova.";

"CompetitorView.TeamImageAddButton.Title" = "Dodaj fotografijo ekipe";

"CompetitorView.UploadTeamImageFailureAlert.Title" = "Napaka pri prenosu slike v strežnik";

/* MARK: - ScanView */
"ScanView.Title" = "Skenirajte QR-kodo";

"ScanView.IncorrectCodeAlert.Message" = "Neveljavna QR-koda";

/* MARK: - SpeedView */
"SpeedView.TitleLabel.Text" = "Hitrost preko dna";

/* MARK: - SettingsView */
"SettingsView.Title" = "Nastavitve";

"SettingsView.TableView.BatterySavingSection.Title" = "Varčevanje z baterijo";

"SettingsView.TableView.DeviceSection.Title" = "Informacije o napravi";

"SettingsView.TableView.TrainingSection.Title" = "Območje treninga";

"SettingsView.BatterySavingTitleLabel.Text" = "Varčevanje z energijo";

"SettingsView.BatterySavingDescriptionLabel.Text" = "Posodobitve GPS se pošiljajo na strežnik vsakih %0.0f s.";

"SettingsView.DeviceIdentifierTitleLabel.Text" = "Identifikator naprave";

"SettingsView.TrainingServerTitleLabel.Text" = "Končna točka strežnika";

/* MARK: - TimerView */
"TimerView.TitleLabel.Text" = "Čas sledenja";

/* MARK: - TrackingView */
"TrackingView.TableView.GPSFixesCell.GPSFixesTitleLabel.Text" = "Neposlani položaji";

"TrackingView.TableView.GPSAccuracyCell.GPSAccuracyTitleLabel.Text" = "Natančnost GPS-a";

"TrackingView.TableView.GPSAccuracyCell.GPSAccuracyLabel.Text.NoGPS" = "Brez GPS-a";

"TrackingView.StopTrackingButton.Title" = "Ustavi sledenje";

"TrackingView.StopTrackingAlert.Title" = "Potrdite";

"TrackingView.StopTrackingAlert.Message" = "Ali res želite ustaviti sledenje?";

